---
kind: other
id: Methods.T:Autodesk.Revit.DB.PrimarySizeCriterion
source: html/2755f586-179a-d928-d563-815823e50d2b.htm
---
# PrimarySizeCriterion Methods

Creates a criterion with a range of all sizes.